{
  "layout": "blog",
  "name": "css",
  "notes": "# Notes on CSS and HTML\n\nI'm really intrigued by how simple but functional css/html can be. If I can find commonly found, reactive features available in pure css/html, I'll place them here. Also a few failed efforts.\n\n## Pure CSS Search\n\n#### 1. ~~Matching on value attribute from ```<input/>```~~\n\n- attempt to narrow a list of items by autocomplete searching and using attribute selectors (likely input[value~=\"\"]\n- content can move [from CSS to HTML](https://css-tricks.com/css-attr-function-got-nothin-custom-properties) just not from HTML to CSS as [it was removed from the spec](https://www.w3.org/TR/selectors-3/#content-selectors). it's also ironically placed under section 6.6.6. \n- ```value=\"\"```'s are added to inputs within react and other frontend frameworks, so the ability to match on an updated value attribute is lost. I originally thought this was inherent in html input elements\n  -  Side note, [CSS keyloggers rely on javascript](https://www.bram.us/2018/02/21/css-keylogger-and-why-you-shouldnt-worry-about-it/) and technically do not work in non-javascript environments\n\n- note that ```<details>``` toggles an open attribute on the element when clicked. If an html element would allow content to be added on a mouse down, you could set an input tags value without javascript, or just remove all but the selected\n\n#### 2. ~~Using the content of a ```<div contenteditable=\"true\" />```~~\n\n- still not an attribute, content is still not selectable even if [editable](https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/Editable_content)\n- the answer might be found with [other global attributes](https://www.w3schools.com/tags/ref_standardattributes.asp)\n\n\n#### 3. ~~Using ```<datalist>``` to autocomplete ```<options/>``` on an ```<input/>```~~\n\n- the killer here is really the same as above. You can autocomplete and technically sub-string 'search' terms based on the native implementation of an ```<inputs list=\"whatever\"/>```\n- the problem is after you select an option, no attribute is set in the html.\n- further more, you [cannot style](https://stackoverflow.com/questions/7208786/how-to-style-the-option-of-an-html-select-element) or [manipulate options](https://github.com/w3c/csswg-drafts/issues/2013) you've created for the dataset in the actual options list because the functionality is handled natively. I attempted setting ```<dataset style=\"position: absolute;\"/>``` and was hoping the static list (assuming it was the same when auto-completing) would start to disappear\n\n#### ~~4. Form submit allowing autocompleted value to be submitted as the slug~~\n - we can substring search the ```<options />```, but we can't reduce the list of options after search. Fine.\n - can we at least utilize the search result with a form?\n - it's either a query param or a \n\n#### 5. (Cheat) Have an expandable, hoverable A-Z list that will collapse the options based on first letter\n -  it's not search, but it will serve the same function\n -  allow letters active and search in an order\n\n\n### Resources\n - [3D Models in CSS](http://tridiv.com/)\n - [20+ impressive CSS Only projects](https://medium.mybridge.co/26-impressive-web-projects-built-with-css-only-4a4c2f773a21?gi=23aa236eb46b)\n - Very ready to give up, found [someone thinking about search in css back in 2013](https://www.redotheweb.com/2013/05/15/client-side-full-text-search-in-css.html)\n\n### Content Toggles\n\n<details>\n  <summary>Content toggles</summary><p>\n\n```\n<details>\n  <summary>Content Toggles</summary>\n  <p>this details tag and some other content</p>\n</details>\n```\n\n</p></details>"
}