{
  "layout": "blog",
  "name": "css",
  "notes": "## Notes on CSS and HTML\n\nI'm really intrigued by how simple but functional css/html can be. If I can find commonly found, reactive features available in pure css/html, I'll place them here. Also a few failed efforts\n\n### Pure CSS Search\n \n#### 1. ~~Matching on value attribute from ```<input/>```~~\n\n- Values are added within react and other frontend frameworks, so matching on an updated attribute is lost. \n- Note that ```<details>``` toggles an open attribute on the element when clicked. If an html element would allow content to be added on a mouse down, you could set an input tags value without Javascript, or just remove all but the selected\n\n#### 2. ~~Using the content of a ```<div contenteditable=\"true\" />```~~\n\n- Still not an attribute, content is still not selectable even if [editable](https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/Editable_content)\n- The answer might be found with [other global attributes](https://www.w3schools.com/tags/ref_standardattributes.asp)\n\n\n#### 3. ~~Using ```<datalist>``` to autocomplete ```<options/>``` on an ```<input/>```~~\n\n- The killer here is really the same as above. You can autocomplete and technically substring 'search' terms based on the native implementation of an ```<inputs list=\"whatever\"/>```\n- The problem is after you select an option, no attribute is set in the html.\n- Further more, you [cannot style](https://stackoverflow.com/questions/7208786/how-to-style-the-option-of-an-html-select-element) or [manipulate options](https://github.com/w3c/csswg-drafts/issues/2013) you've created for the dataset in the actual options list because the functionality is handled natively. I attempted setting ```<dataset style=\"position: absolute;\"/>``` and was hoping the static list (assuming it was the same when autocompleting) would start to disappear\n\n#### 4. Attempt to toggle an option as a radio button, and select on the active radio button\n\n### Content Toggles\n\n<details>\n  <summary>Content toggles</summary><p>\n\n```\n<details>\n  <summary>Content Toggles</summary>\n  <p>this details tag and some other content</p>\n</details>\n```\n\n</p></details>"
}