{
  "layout": "blog",
  "name": "router",
  "notes": "## Open Router\n\n### OpenWrt Rpi\n\n- Raspbery Pi v3\n- [2x Panda Wireless PAU09 N600 Dual Band Wireless N USB AP](https://www.amazon.com/Panda-Wireless-PAU09-Adapter-Antennas/dp/B01LY35HGO/)\n- [NETGEAR 4G LTE Broadband Modem](https://www.amazon.com/NETGEAR-LTE-Modem-Broadband-Connection/dp/B01N5ASNTE)\n\nI've used this setup for a little over 4 years now. The setup includes  a Netgear LTE Modem bridged to the Raspberry Pi over ethernet. Several access points are attached via usb. When used with a T-Mobile data plan, I could get around 10-20mb down and 30mb up. \n\nOver the course of 4 years, OpenWrt on Rpi was fairly stable for basic configurations. The moment I started doing anything more complicated it would crash, most of the time ending up in a kernel panic / boot loop. \n\nSeveral things would kick this off: a tethered android device on one of the few usb ports left or dropping the ESSID of one of the access points. One time it was as small as changing one the AP LEDs config. That one hurt the most. It wouldn't be just making changes in general either, as I changed the SSIDs and passwords frequently. It usually involved changing the way the hardware would interact. After 4 years, I'm tired of having to wipe clean and start again because it was less trouble than figuring out how to change it on the disk while off.\n\nI built up quite a bit of resources I would like to offload just in case.\n\n#### [Changing the TTL to spoof cell traffic](https://www.linuxtopia.org/Linux_Firewall_iptables/x4799.html) \n#### [More TTL examples in DD-WRT docs](https://wiki.dd-wrt.com/wiki/index.php/Iptables#Modifying_the_TTL)\n#### [Installing necessary RT drivers on openwrt](https://forum.openwrt.org/t/how-install-rtl8812au-driver-on-raspberry-pi-3-with-lede/4093/3)\n#### [Installing Other RT drivers](https://forum.openwrt.org/t/raspberry-3-lan-wan-help-needed/1377/7)\n\n```\nopkg update\nopkg install kmod-usb-net-rtl8152\nreboot\n```\n\nI have an instruction set I'll list out here with time. \n\nAll in all,  the ease of use LuCI interface + hardware resource efficiency was really nice to have. When myself or others wanted to make quick changes, it was easy. Unfortunately, the inability to modify anything without the fear of kernel panics and boot loops made it moot.\n\n### Alpine Rpi (armhf)\n\nI set up an array of RPi rsync servers before all running alpine. It worked very well. I'm hoping they'll be just as friendly as a router.\n- https://wiki.alpinelinux.org/wiki/Raspberry_Pi\n  "
}