{
  "layout": "blog",
  "name": "psychology",
  "notes": "# Psychology\n\n## [Laziness / Procrastination](#lazyness)\n\n#### [(Article)Laziness does not exist](https://humanparts.medium.com/laziness-does-not-exist-3af27e312d01)\n\n> When you’re seeking to predict or explain a person’s actions, looking at the social norms, and the person’s context, is usually a pretty safe bet. Situational constraints typically predict behavior far better than personality, intelligence, or other individual-level traits.\n\nIt is better to response to a persons ineffective behavior with curiosity rather than judgement. Author learned this as a result of talking with Kimberly Longhofer, a writer on accommodation for homelessness.\n\nSummary of example is that one who is homeless may buy alcohol because the nights are cold, the world is unfriendly to them and they are uncomfortable in that cold. Alcohol is one of the most accessible tools available compared to help from others around them and a warm bed.\n\n> In that chronically uncomfortable, over-stimulating context, needing a drink or some cigarettes makes fucking sense.\n\n> If a person’s behavior doesn’t make sense to you, it is because you are missing a part of their context. It’s that simple.\n\nProcrastination is much the same problem and has a handful of origins:\n1) Anxiety about their attempts not being \"good enough\"\n2) Confusion about what the next steps are\n3) The task is meaningful and cares about doing it well\n\nSeveral of those apply to my current progress on Tethor and I often don't work on it if I'm not feeling well slept and ready. If goals, and the process to obtain those goals are established, it's much easier to work towards them. The author uses her dissertation as an example where she had her process and time alloted was not __unknown__.\n\nIt reminds me a lot of the unknowns in *product development*\n\nWhen developers burn out it's often due to unknowns or lack of passion of the product. Not knowing the direction of where the product is headed or its purpose does not inspire confidence to work toward the goal.\n\n> If a person can’t get out of bed, something is making them exhausted. If a student isn’t writing papers, there’s some aspect of the assignment that they can’t do without help. If an employee misses deadlines constantly, something is making organization and deadline-meeting difficult. Even if a person is actively choosing to self-sabotage, there’s a reason for it — some fear they’re working through, some need not being met, a lack of self-esteem being expressed.\n\n\n \n\n"
}